# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 1, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 1, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
# [0.0,
#  0.008333333767950535, 0.01666666753590107,
#  0.02500000223517418, 0.03333333507180214, 0.0416666679084301, 0.04999999701976776, 0.05833333358168602, 0.06666666269302368, 0.07500000298023224, 0.0833333358168602,
#  0.09166666865348816, 0.10000000149011612]
  - [-1, 1, PatchEmbed, [40, 4, 4]] # 0-P1/2
  - [-1, 1, BasicStage, [1, 4, 2]] #40
  - [-1, 1, PatchMerging, [2, 2]] # 2
  - [-1, 1, BasicStage, [2, 4, 2]] # 80
  - [-1, 1, PatchMerging, [2, 2]] # 4
  - [-1, 1, BasicStage, [8, 4, 2]] # 160
  - [-1, 1, SPPF, [160, 5]] # 6
  - [-1, 1, PSA, [160]] # 7

# YOLOv8.0n head
head:

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, BiFPN_Concat2, [1]] # cat backbone P3
  - [-1, 3, C2f, [128]] # 10 (P3/8-small) 64

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, BiFPN_Concat2, [1]] # cat backbone P3
  - [-1, 3, C2f, [64]] # 13 (P3/8-small) 64

  - [-1, 1, Conv, [80, 3, 2]]
  - [[-1, 3, 10], 1, BiFPN_Concat3, [1]] # cat head P4
  - [-1, 1, CBAM, [288]]
  - [-1, 3, C2f, [128]] # 17 (P4/16-medium) 128

  - [-1, 1, Conv, [160, 3, 2]]
  - [[-1, 7], 1, BiFPN_Concat2, [1]] # cat head P4
  - [-1, 3, C2f, [256]] # 20 (P4/16-medium) 128

  - [[13, 17, 20], 1, Detect, [nc]] # Detect(P3, P4, P5)
